package task12_6_1.zadanye5;

public class Zadanye5 {
    public static void main(String[] args) {
        System.out.println("""
            Модуль 12. Базы данных и Git. Задание №6:
            Задание:
            5. Внесите любые изменения в данный проект и сделайте соответствующий коммит
            
            Решение:""");

        System.out.println("""
            Я создал репозиторий на ‘https://github.com/’ с названием ‘n240716_Module12_Task6_Zadaniya1-5_TestRep’
            и индикатором доступа: ‘Public’.
            Ссылка на этот репозиторий:
            Я делаю изменения в проекте, и затем делаю 'commit' и 'push', чтобы сохранить изменения в созданном
            мной репозитории.""");
    }
}
