package task12_6_1.zadanye3;

import com.mongodb.client.FindIterable;
import com.mongodb.client.MongoClients;
import com.mongodb.client.MongoCollection;
import com.mongodb.client.MongoDatabase;
import com.mongodb.client.model.Projections;
import org.bson.Document;

import java.util.ArrayList;

public class Zadanye3 {
    public static void main(String[] args) {
        System.out.println("""
            Модуль 12. Базы данных и Git. Задание №6:
            Задание:
            3. Создайте свой первый репозиторий на GitHub
            
            Решение:
            """);

        System.out.println("""
            Я создал репозиторий на ‘https://github.com/’ с названием ‘n240716_Module12_Task6_Zadaniya1-5_TestRep’
            и индикатором доступа: ‘Public’.
            Ссылка на этот репозиторий:
            """);
    }
}
